
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`

#### Terraform `planToApply` 🚀``Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.secrets_backend.aws_secretsmanager_secret.Dev_OReview_backend will be created
  + resource "aws_secretsmanager_secret" "Dev_OReview_backend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-oreview-backend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret.Prod_OReview_backend will be created
  + resource "aws_secretsmanager_secret" "Prod_OReview_backend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oreview-backend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret_version.Dev_backend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_backend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret_version.Prod_backend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_backend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret.Dev_database will be created
  + resource "aws_secretsmanager_secret" "Dev_database" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-database"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret.Prod_database will be created
  + resource "aws_secretsmanager_secret" "Prod_database" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-database"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret_version.Dev_database_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_database_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret_version.Prod_database_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_database_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret.Dev_OReview_frontend will be created
  + resource "aws_secretsmanager_secret" "Dev_OReview_frontend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-oreview-frontend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret.Prod_OReview_frontend will be created
  + resource "aws_secretsmanager_secret" "Prod_OReview_frontend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oreview-frontend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret_version.Dev_frontend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_frontend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret_version.Prod_frontend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_frontend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
``

<details><summary>Show `planToApply`</summary>

```

`Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.secrets_backend.aws_secretsmanager_secret.Dev_OReview_backend will be created
  + resource "aws_secretsmanager_secret" "Dev_OReview_backend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-oreview-backend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret.Prod_OReview_backend will be created
  + resource "aws_secretsmanager_secret" "Prod_OReview_backend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oreview-backend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret_version.Dev_backend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_backend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_backend.aws_secretsmanager_secret_version.Prod_backend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_backend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret.Dev_database will be created
  + resource "aws_secretsmanager_secret" "Dev_database" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-database"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret.Prod_database will be created
  + resource "aws_secretsmanager_secret" "Prod_database" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-database"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret_version.Dev_database_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_database_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_database.aws_secretsmanager_secret_version.Prod_database_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_database_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret.Dev_OReview_frontend will be created
  + resource "aws_secretsmanager_secret" "Dev_OReview_frontend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dev-oreview-frontend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Dev"
        }
      + tags_all                       = {
          + "Environment" = "Dev"
        }

      + replica (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret.Prod_OReview_frontend will be created
  + resource "aws_secretsmanager_secret" "Prod_OReview_frontend" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oreview-frontend"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags                           = {
          + "Environment" = "Prod"
        }
      + tags_all                       = {
          + "Environment" = "Prod"
        }

      + replica (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret_version.Dev_frontend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Dev_frontend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets_frontend.aws_secretsmanager_secret_version.Prod_frontend_sversion will be created
  + resource "aws_secretsmanager_secret_version" "Prod_frontend_sversion" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
`
```

</details>

*Pusher: @yhjs1211, Action: `workflow_dispatch`, Working Directory: ``, Workflow: `Global_secretsManager`*
